Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/social_welfare/social_welfare_payments/disability_and_illness/occupational_injuries_benefit_overview.html.txt.tmx
Source language: en
Languages: pl

source: Occupational Injuries Scheme - Introduction
pl: System zasiłków z tytułu niezdolności do pracy wskutek wypadku przy pracy lub choroby zawodowej

source: The Occupational Injuries Scheme provides benefits for people injured or incapacitated by an accident at work or while travelling directly to or from work
pl: Ministerstwo Spraw Społecznych i Rodzinnych w Irlandii stworzyło system zasiłków dla osób, które doznały urazu lub są niezdolne do pracy w wyniku wypadku w miejscu pracy lub w drodze z/do pracy

source: The scheme also covers people who have contracted a disease as a result of the type of work they do
pl: System obejmuje również osoby, które zachorowały w Irlandii w związku z wykonywaną pracą

source: There are a number of benefits available and there are different conditions attached to each benefit
pl: Istnieje wiele różnych zasiłków. Aby uzyskać prawo do otrzymywania jednego z nich, należy spełnić odpowiednie warunki

source: • Widow's, Widower's or Surviving Civil Partner's Pension (paid at a higher rate than the ordinary Contributory Widow's, Widower's or Surviving Civil Partner's Pension) • Orphan's Pension • Funeral Grant
pl: Jeżeli w związku z wypadkiem przy pracy lub chorobą zawodową, dojdzie do zgonu ubezpieczonego pracownika jego rodzina może otrzymać różne rodzaje zasiłków

source: Injury Benefit is a weekly payment if you are unfit for work due to the accident or disease. Payment is normally made from the 7th day of incapacity for work
pl: Zasiłki te mogą przysługiwać również osobom będącym na utrzymaniu zmarłego, który w chwili zgonu był uprawniony do otrzymywania renty inwalidzkiej w wymiarze co najmniej 50%, niezależnie od przyczyny zgonu

source: Injury Benefit can be paid for up to 26 weeks from the date of your accident or development of the disease (not the date you apply)
pl: Do odprawy wlicza się rentę wdowią lub partnerską, rentę sierocą, zasiłek pogrzebowy

source: If the accident or disease caused you to lose physical or mental ability you should apply for Disablement Benefit before your Injury Benefit ceases
pl: Zasiłek z tytułu wypadku przy pracy jest wypłacany w co tydzień osobom, które są niezdolne do pracy w wyniku wypadku przy pracy lub choroby zawodowej

source: If you are still unfit for work after 26 weeks you may apply for Illness Benefit or Disability Allowance
pl: Zasiłek ten jest wypłacany przez 26 tygodni od daty wypadku lub wykrycia choroby (nie od daty zgłoszenia)

source: Disablement Benefit is paid if you have a loss of physical or mental faculty after the accident or disease
pl: Zasiłek z tytułu inwalidztwa wskutek pracy jest wypłacany w przypadku utraty sprawności fizycznej lub psychicznej w wyniku wypadku przy pracy lub choroby zawodowej

source: You do not have to be unfit for work
pl: Osoba nie musi utracić zdolności do wykonywania pracy, aby otrzymać ten zasiłek

source: If you are fit for work immediately after the accident you should apply within 3 months of the injury or onset of the disease
pl: Jeżeli zdolność do pracy nie została utracona, należy zgłosić się po zasiłek w ciągu trzech miesięcy od wypadku lub wykrycia choroby

source: You must have a medical assessment to determine the degree of loss of faculty and the rate of benefit is based on this
pl: Należy posiadać zaświadczenie lekarskie określające stopień utraty sprawności. Na podstawie tego zaświadczenia ustalana jest wysokość zasiłku

source: (Civil servants insured at Class B are not eligible for Disablement Benefit for the first 26 weeks after the date of the accident
pl: Urzędnikom służby cywilnej ubezpieczonym w Klasie B zasiłek z tytułu inwalidztwa wskutek pracy nie przysługuje przez pierwsze 26 tygodni od dnia wypadku

source: Half-rate benefit only is payable after this period.) Disablement Benefit can be paid as a lump sum (called Disablement Gratuity) or as a weekly payment (called Disablement Pension)
pl: Po upływie tego terminu wypłacana jest połowa stawki zasiłku

source: Incapacity Supplement is a weekly supplement, which may be paid if you are not eligible for Illness Benefit or another social welfare payment
pl: Zasiłek z tytułu niezdolności do pracy jest dodatkiem tygodniowym, który może być wypłacany, jeżeli osoba nie jest uprawniona do otrzymywania zasiłku chorobowego

source: To get the supplement you must be getting Disablement Pension and be permanently incapable of work
pl: Wymagane jest otrzymywanie zasiłku z tytułu inwalidztwa oraz trwała niezdolność do pracy

source: Constant Attendance Allowance is a weekly allowance, which you may be paid if you are getting Disablement Benefit and are so seriously disabled as to need someone to help you daily at home to attend to your personal needs
pl: Stała renta opiekuńcza jest rentą wypłacaną co tydzień w razie ciężkiej choroby, która wymaga pomocy osoby trzeciej przy wykonywaniu codziennych czynności

source: If you incur medical costs as a result of your occupational injury or disease, you can claim for the cost of certain expenses which are not already covered by the Health Service Executive (HSE) or through the Treatment Benefit Scheme under the Medical Care Scheme
pl: Opieka medyczna. Można ubiegać się o zwrot kosztów poniesionych na opiekę medyczną, jeżeli związane są z wypadkiem w miejscu pracy lub chorobą zawodową i jeżeli koszty te nie są pokrywane przez Rejonowe Służby Zdrowia (HSE) lub przez System Refundacji Kosztów Leczenia

source: The cost of private or semi-private accommodation and treatment can not be recouped under the Occupational Injuries Scheme
pl: Koszty zakwaterowania oraz leczenia prywatnego lub półprywatnego nie są zwracane w ramach systemu zasiłków z tytułu niezdolności do pracy wskutek wypadku przy pracy lub choroby zawodowej

source: In general people in employment insurable at PRSI Class A, D, J or M are covered in full for Occupational Injuries Benefits
pl: Najczęściej pracownicy, których obejmuje ubezpieczenie społeczne (PRSI) w klasie A, D, J lub M, są uprawnieni do otrzymywania wszystkich zasiłków wypłacanych z tytułu niezdolności do pracy wskutek wypadku przy pracy lub choroby zawodowej

source: Civil servants recruited prior to April 1995 and insured at Class B may only qualify for limited Occupational Injuries Benefits
pl: Urzędnicy służby cywilnej zatrudnieni przed kwietniem 1995 r. i ubezpieczeni w klasie B uprawnieni są do otrzymywania tylko niektórych zasiłków z tytułu wypadku przy pracy lub choroby zawodowej

source: Education and Training Board trainees, people on employment schemes and people over 66 who are working are covered for Occupational Injuries Benefits
pl: Osoby uczestniczące w szkoleniach i projektach FÁS oraz osoby pracujące, które ukończyły 66 lat, są objęte programem zasiłków z tytułu niezdolności do pracy wskutek wypadku przy pracy lub choroby zawodowej

source: Unlike other social insurance benefits, it is not necessary to have a set number of PRSI contributions to qualify
pl: Wystarczy być zatrudnionym oraz ubezpieczonym na wypadek niezdolności do pracy wskutek wypadku przy pracy lub choroby zawodowej

source: It is simply necessary to be in employment that is insurable for Occupational Injuries
pl: Składki na ubezpieczenie opłaca pracodawca, a nie pracownik

source: Civil law claims for damages
pl: Żądanie odszkodowania na drodze cywilnoprawnej

source: The Recovery of Certain Benefits and Assistance (RBA) Scheme enables the Department of Social Protection to recover the value of certain illness-related social welfare payments as a consequence of personal injuries claims
pl: W przypadku niezdolności do pracy wskutek wypadku przy pracy lub choroby zawodowej można wnieść pozew cywilny przeciwko pracodawcy

source: They are recovered from the compensator and not from the injured person
pl: Otrzymywanie zasiłku z tytułu niezdolności do pracy wskutek wypadku przy pracy lub choroby zawodowej nie gwarantuje przyznania przez sąd odszkodowania z tego samego tytułu

source: Read more about the scheme
pl: Inne zasiłki socjalne nie są brane pod uwagę
